#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details>
  <summary>Validation Output</summary>

  ```

  Success! The configuration is valid.


  ```

</details>

#### Terraform Plan 📖`failure`

<details>
  <summary>Show Plan</summary>

  ```

  terraform
cloudflare_record.oldbigbuddhadev_txt_atproto: Refreshing state... [id=0d023007dc826f42f6769fc6204300e4]
cloudflare_record.ojilabcloud_a_access_demo2: Refreshing state... [id=cf61289d7f1a9b7cb60d5ea869023a80]
cloudflare_record.oldbigbuddhadev_txt_googledomainkey: Refreshing state... [id=ce56f2c7147dbc2705263b65a73c7c1f]
cloudflare_record.oldbigbuddhanet_txt_root_spf: Refreshing state... [id=fc41f938578cbf89b1cc43c20d4dc15f]
cloudflare_record.oldbigbuddhanet_mx_root3: Refreshing state... [id=44bbc53fec42d02d1ea9cca6809532bd]
cloudflare_record.oldbigbuddhanet_mx_root1: Refreshing state... [id=c3cea26920aaaf6d97345ac6c627e045]
cloudflare_record.oldbigbuddhadev_cname_www: Refreshing state... [id=69f5b3a7a9d62874e05103cd3cdc3ea2]
cloudflare_record.roppojsondev_txt_root_github_challenge: Refreshing state... [id=fba61672cbffe22a37638a1c5f200d57]
cloudflare_record.oldbigbuddhadev_a_root: Refreshing state... [id=3f97e5ef42c2ed4d824a1fc51aa343e6]
cloudflare_record.ojilabcloud_a_access_demo1: Refreshing state... [id=3309c53bf29d55fd2526aeec15dd148a]
cloudflare_record.oldbigbuddhanet_txt_root_keybase: Refreshing state... [id=8db72b8fd9c77872db3b835bd88b849b]
cloudflare_record.roppojsondev_a_root3: Refreshing state... [id=e785317c6d0423b0ac03f967c3aba8d2]
cloudflare_record.oldbigbuddhanet_mx_root4: Refreshing state... [id=0d18e0fb8ec210f5cd6d3a6401539dea]
cloudflare_record.roppojsondev_a_root4: Refreshing state... [id=32b531dca6e2f2d56daa36c69188b46a]
cloudflare_record.oldbigbuddhadev_txt_dmarc: Refreshing state... [id=0529e09069aa1ec8c76d6bcb618396d8]
cloudflare_record.roppojsondev_cname_api: Refreshing state... [id=f5828f118b49eff121abce5439b68faa]
cloudflare_record.oldbigbuddhanet_txt_googledomainkey: Refreshing state... [id=9d4438183ebba56fc64d7bea20ce2cee]
cloudflare_record.oldbigbuddhanet_mx_root5: Refreshing state... [id=47edbc963796698ec9e6ad1d5557306b]
cloudflare_record.oldbigbuddhadev_mx_root1: Refreshing state... [id=6bec147f8cab80017d79bbd859059987]
cloudflare_record.ojilabcloud_a_access_demo3: Refreshing state... [id=64621338dcba1888ea222bc6bf0e5a6a]
cloudflare_record.ojilabcloud_txt_access_demo: Refreshing state... [id=a9b5de7ba34b27d4976d0f6553d5dc58]
cloudflare_record.roppojsondev_a_root2: Refreshing state... [id=acf15f304482581d697126e6ab7673e4]
cloudflare_record.ojilabcloud_a_access_demo4: Refreshing state... [id=4703d3a01a6674241f0b22dca0f94fa0]
cloudflare_record.oldbigbuddhadev_txt_root_spf: Refreshing state... [id=7350a514e217b20c5a1b49143af540db]
cloudflare_record.oldbigbuddhanet_txt_dmarc: Refreshing state... [id=c6b9208eb8ed5f4f396947e9544d3ea9]
cloudflare_record.oldbigbuddhadev_txt_root_openai: Refreshing state... [id=7c9f2bc37708829e7129dd528b120af1]
cloudflare_record.oldbigbuddhadev_txt_discord: Refreshing state... [id=d31f73d36a28616a632a8af405cadb56]
cloudflare_record.oldbigbuddhadev_mx_root4: Refreshing state... [id=bf64375ca7c77d4740eaa4569dc20ff8]
cloudflare_record.oldbigbuddhadev_txt_root_googlesiteverification: Refreshing state... [id=50ba0d0a39d3f19cb4542b9da07ab06a]
cloudflare_record.oldbigbuddhadev_mx_root2: Refreshing state... [id=10bdfdfd0da732d77f121c764cb5bd9e]
cloudflare_record.roppojsondev_a_root1: Refreshing state... [id=3343618b069586870cbf95ac53ff06ea]
cloudflare_record.oldbigbuddhadev_txt_keybase: Refreshing state... [id=677a50af439d16c1671909787021d08a]
cloudflare_record.oldbigbuddhanet_cname_root: Refreshing state... [id=64228ed4926d0455abab53284917fab2]
cloudflare_record.oldbigbuddhadev_a_wp: Refreshing state... [id=1f1f1a2ce2f8000992f75aa4baefaf41]
cloudflare_record.oldbigbuddhadev_a_sample: Refreshing state... [id=a580528d6e91f25caaac24c11beaf53e]
cloudflare_record.ojilabcloud_a_reservation: Refreshing state... [id=6bc3cbcfb619e14f7e7db88ceef1c230]
cloudflare_record.oldbigbuddhanet_mx_root2: Refreshing state... [id=ad4ecb73e10ee14be3227a900d2cfd47]
cloudflare_record.ojilabcloud_txt_root_googlesiteverification: Refreshing state... [id=3d9d1ac89c33c0a32240433755fcc682]
cloudflare_record.oldbigbuddhadev_mx_root3: Refreshing state... [id=1e530993fb18221dc94aba7ad2c9196a]
cloudflare_record.oldbigbuddhadev_mx_root5: Refreshing state... [id=1ff4992d84000f21304fafc9d1627b7a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # cloudflare_record.ojilabcloud_a_cname_sample_discord_interaction will be created
  + resource "cloudflare_record" "ojilabcloud_a_cname_sample_discord_interaction" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sample.discord-interaction"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "eb1dc0c7-65df-44b9-8c23-f7ab5df8acf8.cfargotunnel.com"
      + zone_id         = "f887b3adea226972affc939e06efab29"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

  ```

</details>
*Pusher: @OldBigBuddha, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*